reports/create_user
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 10,
      "vusers.created": 10,
      "http.requests": 10,
      "http.codes.201": 10,
      "http.responses": 10,
      "plugins.metrics-by-endpoint./api/users.codes.201": 10,
      "plugins.expect.failed": 10,
      "plugins.expect.failed.statusCode": 10,
      "errors.Failed expectations for request https://reqres.in/api/users": 10,
      "vusers.failed": 10
    },
    "histograms": {
      "http.response_time": {
        "mapping": {
          "relativeAccuracy": 0.009999999999999957,
          "_offset": 0,
          "gamma": 1.02020202020202,
          "_multiplier": 34.65620375188833,
          "minPossible": 1.135012422773875e-308,
          "maxPossible": 1.7620952510036562e+308
        },
        "store": {
          "chunkSize": 128,
          "bins": [
            0,
            0,
            0,
[...]
            1,
            2,
            1,
            3,
            0,
            1,
            0,
            1,
            0,
            1,
            0,
            0,
            0,
[...]
            0
          ],
          "count": 10,
          "minKey": 183,
          "maxKey": 438,
          "offset": 183
        },
        "negativeStore": {
          "chunkSize": 128,
          "bins": [],
          "count": 0,
          "minKey": null,
          "maxKey": null,
          "offset": 0
        },
        "zeroCount": 0,
        "count": 10,
        "min": 469,
        "max": 557,
        "sum": 5021
      },
      "plugins.metrics-by-endpoint.response_time./api/users": {
        "mapping": {
          "relativeAccuracy": 0.009999999999999957,
          "_offset": 0,
          "gamma": 1.02020202020202,
          "_multiplier": 34.65620375188833,
          "minPossible": 1.135012422773875e-308,
          "maxPossible": 1.7620952510036562e+308
        },
        "store": {
          "chunkSize": 128,
          "bins": [
            0,
            0,
            0,
[...]
            1,
            2,
            1,
            3,
            0,
            1,
            0,
            1,
            0,
            1,
            0,
            0,
            0,
[...]
            0
          ],
          "count": 10,
          "minKey": 183,
          "maxKey": 438,
          "offset": 183
        },
        "negativeStore": {
          "chunkSize": 128,
          "bins": [],
          "count": 0,
          "minKey": null,
          "maxKey": null,
          "offset": 0
        },
        "zeroCount": 0,
        "count": 10,
        "min": 469,
        "max": 557,
        "sum": 5021
      }
    },
    "rates": {
      "http.request_rate": 3
    },
    "http.request_rate": null,
    "firstCounterAt": 1647326278883,
    "firstHistogramAt": 1647326279647,
    "lastCounterAt": 1647326284139,
    "lastHistogramAt": 1647326284138,
    "firstMetricAt": 1647326278883,
    "lastMetricAt": 1647326284139,
    "period": 1647326280000,
    "summaries": {
      "http.response_time": {
        "min": 469,
        "max": 557,
        "count": 10,
        "p50": 497.8,
        "median": 497.8,
        "p75": 497.8,
        "p90": 539.2,
        "p95": 539.2,
        "p99": 539.2,
        "p999": 539.2
      },
      "plugins.metrics-by-endpoint.response_time./api/users": {
        "min": 469,
        "max": 557,
        "count": 10,
        "p50": 497.8,
        "median": 497.8,
        "p75": 497.8,
        "p90": 539.2,
        "p95": 539.2,
        "p99": 539.2,
        "p999": 539.2
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 3,
        "vusers.created": 3,
        "http.requests": 3,
        "http.codes.201": 1,
        "http.responses": 1,
        "plugins.metrics-by-endpoint./api/users.codes.201": 1,
        "plugins.expect.failed": 1,
        "plugins.expect.failed.statusCode": 1,
        "errors.Failed expectations for request https://reqres.in/api/users": 1,
        "vusers.failed": 1
      },
      "histograms": {
        "http.response_time": {
          "mapping": {
            "relativeAccuracy": 0.009999999999999957,
            "_offset": 0,
            "gamma": 1.02020202020202,
            "_multiplier": 34.65620375188833,
            "minPossible": 1.135012422773875e-308,
            "maxPossible": 1.7620952510036562e+308
          },
          "store": {
            "chunkSize": 128,
            "bins": [
              0,
              0,
              0,
[...]
              1,
              0,
              0,
              0,
[...]
              0
            ],
            "count": 1,
            "minKey": 245,
            "maxKey": 372,
            "offset": 245
          },
          "negativeStore": {
            "chunkSize": 128,
            "bins": [],
            "count": 0,
            "minKey": null,
            "maxKey": null,
            "offset": 0
          },
          "zeroCount": 0,
          "count": 1,
          "min": 480,
          "max": 480,
          "sum": 480
        },
        "plugins.metrics-by-endpoint.response_time./api/users": {
          "mapping": {
            "relativeAccuracy": 0.009999999999999957,
            "_offset": 0,
            "gamma": 1.02020202020202,
            "_multiplier": 34.65620375188833,
            "minPossible": 1.135012422773875e-308,
            "maxPossible": 1.7620952510036562e+308
          },
          "store": {
            "chunkSize": 128,
            "bins": [
              0,
              0,
              0,
[...]
              1,
              0,
              0,
              0,
[...]
              0
            ],
            "count": 1,
            "minKey": 245,
            "maxKey": 372,
            "offset": 245
          },
          "negativeStore": {
            "chunkSize": 128,
            "bins": [],
            "count": 0,
            "minKey": null,
            "maxKey": null,
            "offset": 0
          },
          "zeroCount": 0,
          "count": 1,
          "min": 480,
          "max": 480,
          "sum": 480
        }
      },
      "rates": {
        "http.request_rate": 3
      },
      "http.request_rate": null,
      "firstCounterAt": 1647326278883,
      "firstHistogramAt": 1647326279647,
      "lastCounterAt": 1647326279885,
      "lastHistogramAt": 1647326279651,
      "firstMetricAt": 1647326278883,
      "lastMetricAt": 1647326279885,
      "period": "1647326270000",
      "summaries": {
        "http.response_time": {
          "min": 480,
          "max": 480,
          "count": 1,
          "p50": 478.3,
          "median": 478.3,
          "p75": 478.3,
          "p90": 478.3,
          "p95": 478.3,
          "p99": 478.3,
          "p999": 478.3
        },
        "plugins.metrics-by-endpoint.response_time./api/users": {
          "min": 480,
          "max": 480,
          "count": 1,
          "p50": 478.3,
          "median": 478.3,
          "p75": 478.3,
          "p90": 478.3,
          "p95": 478.3,
          "p99": 478.3,
          "p999": 478.3
        }
      }
    },
    {
      "counters": {
        "http.codes.201": 9,
        "http.responses": 9,
        "plugins.metrics-by-endpoint./api/users.codes.201": 9,
        "plugins.expect.failed": 9,
        "plugins.expect.failed.statusCode": 9,
        "errors.Failed expectations for request https://reqres.in/api/users": 9,
        "vusers.failed": 9,
        "vusers.created_by_name.0": 7,
        "vusers.created": 7,
        "http.requests": 7
      },
      "histograms": {
        "http.response_time": {
          "mapping": {
            "relativeAccuracy": 0.009999999999999957,
            "_offset": 0,
            "gamma": 1.02020202020202,
            "_multiplier": 34.65620375188833,
            "minPossible": 1.135012422773875e-308,
            "maxPossible": 1.7620952510036562e+308
          },
          "store": {
            "chunkSize": 128,
            "bins": [
              0,
              0,
              0,
[...]
              1,
              1,
              1,
              3,
              0,
              1,
              0,
              1,
              0,
              1,
              0,
              0,
              0,
[...]
              0
            ],
            "count": 9,
            "minKey": 249,
            "maxKey": 376,
            "offset": 249
          },
          "negativeStore": {
            "chunkSize": 128,
            "bins": [],
            "count": 0,
            "minKey": null,
            "maxKey": null,
            "offset": 0
          },
          "zeroCount": 0,
          "count": 9,
          "min": 469,
          "max": 557,
          "sum": 4541
        },
        "plugins.metrics-by-endpoint.response_time./api/users": {
          "mapping": {
            "relativeAccuracy": 0.009999999999999957,
            "_offset": 0,
            "gamma": 1.02020202020202,
            "_multiplier": 34.65620375188833,
            "minPossible": 1.135012422773875e-308,
            "maxPossible": 1.7620952510036562e+308
          },
          "store": {
            "chunkSize": 128,
            "bins": [
              0,
              0,
              0,
[...]
              1,
              1,
              1,
              3,
              0,
              1,
              0,
              1,
              0,
              1,
              0,
              0,
              0,
[...]
              0
            ],
            "count": 9,
            "minKey": 249,
            "maxKey": 376,
            "offset": 249
          },
          "negativeStore": {
            "chunkSize": 128,
            "bins": [],
            "count": 0,
            "minKey": null,
            "maxKey": null,
            "offset": 0
          },
          "zeroCount": 0,
          "count": 9,
          "min": 469,
          "max": 557,
          "sum": 4541
        }
      },
      "rates": {
        "http.request_rate": 2
      },
      "http.request_rate": null,
      "firstCounterAt": 1647326280200,
      "firstHistogramAt": 1647326280200,
      "lastCounterAt": 1647326284139,
      "lastHistogramAt": 1647326284138,
      "firstMetricAt": 1647326280200,
      "lastMetricAt": 1647326284139,
      "period": "1647326280000",
      "summaries": {
        "http.response_time": {
          "min": 469,
          "max": 557,
          "count": 9,
          "p50": 497.8,
          "median": 497.8,
          "p75": 518.1,
          "p90": 539.2,
          "p95": 539.2,
          "p99": 539.2,
          "p999": 539.2
        },
        "plugins.metrics-by-endpoint.response_time./api/users": {
          "min": 469,
          "max": 557,
          "count": 9,
          "p50": 497.8,
          "median": 497.8,
          "p75": 518.1,
          "p90": 539.2,
          "p95": 539.2,
          "p99": 539.2,
          "p999": 539.2
        }
      }
    }
  ]
}